/*
Напишіть функцію, яка приймає 2 рядки та порівнює їх
довжину. Функція повертає 1, якщо в першому рядку
більше символів, ніж у другому; -1 – якщо у другому більше символів, ніж у першому; 0 – якщо рядки однакової
довжини.
*/


/*
Напишіть функцію яка переводить у верхній регістр перший символ рядка
*/

let js = "javaScript";
console.log('js: ', js);
// js[0] = "J"; // не робоча штука
// console.log("Js ", js[0].toUpperCase());

let firstLetter = js[0].toUpperCase();
let result = firstLetter.concat(js.slice(1));
console.log(result);
